hw0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Homework 0</title>
<!-- 2013-11-27 Wed 21:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tom O'Brien" />
</head>
<body>
<div id="content">
<h1 class="title">Homework 0</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Obtain a copy of SICP</h2>
<div class="outline-text-2" id="text-1">
<p>
SICP is available both in <a href="http://www.amazon.co.uk/Structure-Interpretation-Computer-Electrical-Engineering/dp/0262510871/ref=sr_1_1?ie=UTF8&qid=1385586049&sr=8-1&keywords=structure+and+interpretation+of+computer+programs">physical</a> and <a href="https://mitpress.mit.edu/sicp/full-text/book/book.html">electronic</a> forms.  The latter
is freely available and is licensed under a Creative Commons
NonCommercial License.
</p>

<p>
Download (or order!) a copy of the text, and read <a href="https://mitpress.mit.edu/sicp/full-text/book/book-Z-H-9.html#%25_chap_1">the introduction to Section 1</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Set up your development environment</h2>
<div class="outline-text-2" id="text-2">
<p>
Lisp has many dialects, e.g. Common Lisp, Clojure (Lisp on the JVM), GOOL
(developed at Naughty Dog and <a href="http://all-things-andy-gavin.com/2011/03/12/making-crash-bandicoot-gool-part-9/">used in the development of the Crash Bandicoot series of games</a>)
and Scheme, the dialect used in this course.  Scheme itself comes in many different flavours,
and each flavour has its own quirks and installation process.
</p>

<p>
The suggested flavour of Scheme used in this course is <a href="https://www.gnu.org/software/mit-scheme/">MIT/GNU Scheme</a>, though <a href="http://racket-lang.org/">Racket</a> is also
a popular choice.  Both have their own associated development environments,
and this part of the homework is to get you set-up with one of them.  Alternatively,
both Emacs and Vim support integration with a running MIT/GNU Scheme or Racket process.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> MIT/GNU Scheme</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/mit-scheme/">Download</a> MIT/GNU Scheme for your development platform.
</li>
<li>Install and open the MIT/GNU Scheme implementation either from
the installed Application or by running
<div class="org-src-container">

<pre class="src src-shell">mit-scheme --edit
</pre>
</div>
<p>
at the command line.
</p>
</li>
<li>You are now in Edwin, the MIT/GNU Scheme editor. It is very
similar to Emacs, though written in Scheme.  If this is the first
time in an Emacs-like environment, enter and complete the
interactive tutorial by executing the key-chord <code>Ctrl-h t</code> (Emacs
and Edwin abbreviate this to <code>C-h t</code>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Racket</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="http://racket-lang.org/download/">Download</a> Racket for your development platform.
</li>
<li>Open the installed DrRacket application for a Racket development
environment.
</li>
<li><b>Important</b>: Racket departs from Scheme in certain ways that make
some of the exercises in SICP impossible.  This can be remedied
by adding
<div class="org-src-container">

<pre class="src src-scheme">#lang planet neil/sicp
</pre>
</div>
<p>
to the top of any Scheme file you're editing (cf. <a href="http://www.neilvandyke.org/racket-sicp/">Neil Van Dyke</a>'s
page for more details).  The first time you run a program with
this header, DrRacket will download the required packages.
</p>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tom O'Brien</p>
<p class="date">Created: 2013-11-27 Wed 21:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.93.1 (<a href="http://orgmode.org">Org</a> mode 8.2.1)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
